Revit 2021.1 API
ExternalDefinitionCreationOptions Constructor
 Constructs the options using a specified name and type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2015
Syntax
C#
public ExternalDefinitionCreationOptions(
	string name,
	ParameterType type
)
Visual Basic
Public Sub New ( _
	name As String, _
	type As ParameterType _
)
Visual C++
public:
ExternalDefinitionCreationOptions(
	String^ name,
	ParameterType type
)
Parameters
name
Type: System.String
 The name of the parameter definition to be created.
type
Type: Autodesk.Revit.DB.ParameterType
 The name of the parameter type for the new definition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace